{
  "skills": [
    {
      "id": 1,
      "title": "Développement Front-end",
      "icon" : "fas fa-desktop",
      "Description": [
        "HTML5, CSS3, SASS et JavaScript : Création de sites modernes et interactifs en utilisant les dernières technologies front-end",
        "React : Développement d'interfaces utilisateur réactives et dynamiques",
        "Composants React : Construction de composants réutilisables pour favoriser une architecture modulaire et maintenable"
      ]
    },
    {
      "id": 11,
      "title": "Développement Back-end",
      "icon" : "fas fa-database",
      "Description": [
        "NodeJs, Express : Création de serveurs robustes et évolutifs",
        "MySQL, MongoDB : Stockage et gestion des données ",
        "APIs RESTful : Mise en place de la communication entre le frontend et le backend",
        "Sécurité : Mécanismes d'authentification et de sécurité pour protéger les données sensibles"
      ]
    },
    {
      "id": 2,
      "title": "Design Web Convivial ",
      "icon" : "fa-solid fa-icons",
      "Description": [
        "Responsive Design : Adaptation de l'affichage des sites web aux mobiles, tablettes, ordinateurs",
        "UX/UI Design : Création d'interfaces utilisateur intuitives pour une agréable expérience utilisateur"
      ]
    },
    {
      "id": 4,
      "title": "Optimisation et SEO",
      "icon" : "fas fa-bullseye",
      "Description": [
        ":Amélioration des performances pour un chargement rapide du site et une expérience utilisateur fluide",
        "Architecture SEO-friendly : Structuration du contenu et utilisation de balises HTML appropriées pour faciliter l'indexation et le classement du site par les moteurs de recherche",
        "Accessibilité : Respect des normes d'accessibilité pour permettre à tous les utilisateurs de naviguer et d'interagir avec un site facilement"
      ]
    },
    {
      "id": 5,
      "title": "Intégration de CMS",
      "icon" : "fa-brands fa-wordpress",
      "Description": [
        ":Intégration personnalisée de sites web avec  systèmes de gestion tels que WordPress, Drupal, Joomla ..."
      ]
    },
    {
      "id": 6,
      "title": "Autres compétences",
      "icon" : "fas fa-screwdriver",
      "Description": [
        "Git : Gestion du code source, collaboration avec les équipes de développement",
        "Design Graphique : Création de maquettes et de ressources graphiques pour les sites web",
        "Green Code : Pratiques de programmation et de développement informatique qui visent à réduire l'empreinte environnementale en optimisant la consommation d'énergie et en minimisant les ressources utilisées"
      ]
    }
  ],
"aboutMe": [
  {
    "id": 1,
    "accr": "La conception de sites web interactifs et esthétiquement plaisants est un défi palpitant ; PME, associations ou particuliers, je serai ravie de partager mes compétences et ma passion pour le développement web en répondant à vos besoins de création de site Internet. ",
    "desc": [
      "Diplômée scientifique et passionnée par les mondes de la Tech, je me suis dirigée en 1999 vers les métiers de l’informatique autour du développement web en ASP.",
      "Après avoir travaillé sur des outils d’apprentissage de langues pendant plusieurs années, j'ai choisi de faire une pause professionnelle consacrée à ma famille, au cours de laquelle j’ai continué à nourrir mon intérêt :",
      " - pour l’Informatique en suivant des cours en ligne certifiants,","  - pour l’Éducation avec l’obtention du CRPE(Concours de Recrutement de Professeur des Écoles) et du C2i2E(Certificat Informatique et Internet de l’Enseignement Supérieur, niveau enseignant) en 2007, suivis  pendant plusieurs années d'interventions hebdomadaires en école primaire pour des cours de préparation au B2i (Brevet Informatique et Internet).",
      "Au fil des années, j'ai développé un véritable attrait pour la création de sites web, répondant aux besoins spécifiques de divers horizons (Éducation Nationale, associations sportives, sites professionnels).",
      "Avec l'évolution rapide des technologies, une nécessaire mise à jour des connaissances s’est imposée, concrétisée par une formation diplômante de « Développeur Web » chez Openclassrooms. Cet enseignement professionnel m’a permis d’acquérir les compétences nécessaires pour devenir une développeuse web polyvalente, avec l'utilisation de langages de programmation tels que HTML5, CSS3 et Javascript et en explorant des frameworks actuels tels que React et NodeJs.",
      "Aujourd'hui, forte de ce parcours atypique, et enthousiaste à l'idée d'explorer vos idées, j'ai hâte d'imaginer un site internet à votre image."
    ]
  }
]
}