{
  "skills": [
    {
      "id": 1,
      "title": "Développement Front-end",
      "rating":"2",
      "icon" : "fas fa-desktop",
      "Description": [
        "HTML5, CSS3, SASS et JavaScript : Création de sites modernes, animés et interactifs en utilisant les dernières technologies",
        "React : Développement d'interfaces utilisateur réactives et dynamiques avec construction de composants réutilisables",
        "Outils : VS Code, Git, ESLint (analyse du code), Webpack (efficacité et optimisation du code), Babel (compatibilité navigateurs)"
      ]
    },
    {
      "id": 2,
      "title": "Design Web Convivial ",
      "rating":"2",
      "icon" : "fa-solid fa-icons",
      "Description": [
        "Prototypage : Utilisation de Figma, de Miro pour la conception graphique",
        "Responsive Design : Adaptation de l'affichage des sites web aux mobiles, tablettes, ordinateurs",
        "UX/UI Design : Création d'interfaces utilisateur intuitives pour une expérience utilisateur agréable"
      ]
    },    
    {
      "id": 3,
      "title": "Optimisation et SEO",
      "rating":"2",
      "icon" : "fas fa-bullseye",
      "Description": [
        "Audits : Optimisation des performances d’un site web (GTMetrix,Lighthouse)",
        "Architecture SEO-friendly : Structuration du contenu et utilisation de balises HTML appropriées pour faciliter l'indexation et le classement du site par les moteurs de recherche",
        "Accessibilité : Respect des normes d'accessibilité pour permettre à tous les utilisateurs de naviguer et d'interagir facilement",
        "Référencement : Balises spécifiques pour réseaux sociaux ou sur les moteurs de recherche"
      ]
    },    
    {
      "id": 4,
      "title": "Développement Back-end",
      "rating":"1",
      "icon" : "fas fa-database",
      "Description": [
        "NodeJs, Express : Création de serveurs robustes et évolutifs",
        "MySQL, MongoDB : Stockage et gestion des données ",
        "APIs RESTful : Mise en place de la communication entre le frontend et le backend",
        "Sécurité : Mécanismes d'authentification et de sécurité pour protéger les données sensibles"
      ]
    },
    {
      "id": 5,
      "title": "Gestion de projet Agile",
      "rating":"1",
      "icon" : "fa-solid  fa-arrows-rotate",
      "Description": [
        "Méthode Scrum :rôles définis, itérations courtes ",
        "Outil de gestion de projet Kanban : pour une gestion visuelle des fonctionnalités découpées en tâches",
        "Documentation : Rédaction des spécifications techniques d'un projet web à partir de besoins fonctionnels",
        "Adaptabilité : communication, collaboration régulière ",
        "Veille technologique : DailyDev, Feedly, Wakelet"
      ]
    },
    {
      "id": 6,
      "title": "Autres compétences",
      "rating":"1",
      "icon" : "fas fa-screwdriver",
      "Description": [
        "Langages (niveau débutant): C++, python, Shell Bash",
        "Git : Gestion du code source, collaboration avec les équipes de développement",
        "Intégration de CMS : Intégration personnalisée de sites web avec  systèmes de gestion, WordPress, Drupal, Joomla ...",
        "Green Code : Conception de sites web plus respectueux de l'environnement"
      ]
    }
  ],
"aboutMe": [
  {
    "id": 1,
    "accr": "La conception de sites web interactifs et personnalisés est un défi palpitant ; professionnels, associations ou particuliers, je serai ravie de partager mes compétences et ma passion pour le développement web en répondant à vos besoins de création de site Internet. ",
    "desc": [
      "Je suis Pascale Pierrard, diplômée d'un DEA scientifique et passionnée par les mondes de la Tech, avec une expérience depuis 1999 dans le développement web avec ASP (Active Server Pages, technologie logicielle destinée à créer des sites web dynamiques).",
      "Après avoir travaillé sur la création d' outils d’apprentissage de langues pendant plusieurs années chez Auralog (Rosetta Stone), j'ai choisi de faire une pause professionnelle consacrée à ma famille, au cours de laquelle j’ai continué à nourrir mon intérêt :",
      " - pour l’Informatique en suivant des cours en ligne certifiants chez Openclassrooms (javascript, python, initiation à l'IA) et des tutoriels sur les sites de Grafikart et de l'École du Web (développement frontend)","  - pour l’Éducation avec l’obtention du CRPE(Concours de Recrutement de Professeur des Écoles) et du C2i2E(Certificat Informatique et Internet de l’Enseignement Supérieur, niveau enseignant) en 2007, suivis  pendant plusieurs années d'interventions hebdomadaires en école primaire pour des cours de préparation au B2i (Brevet Informatique et Internet).",
      "Au fil des années, j'ai développé un véritable attrait pour la création de sites web, répondant aux besoins spécifiques de divers horizons (Éducation Nationale, associations sportives et culturelles, sites professionnels).",
      "Avec l'évolution rapide des technologies, une nécessaire mise à jour des connaissances s’est imposée, concrétisée par une formation diplômante de « Développeur Web » chez Openclassrooms. Cet enseignement professionnel m’a permis d’acquérir les compétences nécessaires pour devenir une développeuse web polyvalente, avec l'utilisation de langages de programmation tels que HTML5, CSS3 et Javascript et en explorant des frameworks actuels tels que React et NodeJs.",
      "Aujourd'hui, forte de ce parcours atypique, et enthousiaste à l'idée d'explorer vos idées, j'ai hâte d'imaginer un site internet à votre image."
    ]
  }
]
}